Repository: InterstellarRiftCommunityTools/InterstellarRiftServerExtender
Catalog: InterstellarRiftServerExtender/Languages/IRSE.*.resx
Languages: ru_ru

# Initialization
source: Interstellar Rift Extended Server v{0} Initializing....
ru_ru: Инициализация Interstellar Rift Server Extender v{0} ...

# IRNotFound
source: IRSE: IR.EXE wasn't found. Make sure IRSE.exe is in the same folder as IR.exe. Press enter to close.
ru_ru: IRSE: Приложение IR.EXE не найдено. Убедитесь, что IRSE.exe находится в одной папке с файлом IR.exe. Нажмите ENTER, для того чтобы закрыть окно.

# GameConsoleEnabled
source: IRSE: Game Console Commands Enabled.
ru_ru: IRSE: Консольные команды активированы

# ServerIsAlreadyRunning
source: The server is already running!
ru_ru: Сервер уже запущен!

# StopRunningServers
source: Attempting to stop any running servers.
ru_ru: Останавливаю сервер...

# UseDevVersion
source: IRSE: (Arg: -usedevversion is set) IRSE Will use Pre-releases versions
ru_ru: IRSE будет использовать тестовые сборки и версии. (Аргумент: -usedevversion установлен)

# NoUpdate
source: IRSE: (Arg: -noupdate is set or option in IRSE config is enabled) IRSE will not be auto-updated.
ru_ru: IRSE: Авто-обновление программы отключено. (Аргумент: -noupdate установлен либо включен в настройках IRSE )

# NoUpdateIR
source: IRSE: (Arg: -noupdateir is set) IsR Dedicated Server will not be auto-updated.
ru_ru: IRSE: Авто-обновление серверных файлы игры отключено. (Аргумент: -noupdateir установлен)

# AutoStart
source: IRSE: Arg: -autostart or Gui's Autostart Checkbox was Checked)
ru_ru: IRSE: Активирована функция автостарта сервера. (Аргумент: -autostart установлен либо включено в настройках IRSE)

# NonInteractive
source: Non interactive environment detected, GUI disabled
ru_ru: Поддержка вывода графики не обнаружена - Графический пользовательский интерфейс будет отключен

# GUIDisabled
source: IRSE: GUI Disabled
ru_ru: Графический интерфейс отключен

# CommandNoExist
source: IRSE: command Doesn't Exist.
ru_ru: IRSE: такой команды не существует...

# CommandException
source: IRSE: Command exception!
ru_ru: IRSE: Ошибка при выполнении команды...

source: For Game Version:
ru_ru: Поддерживаемая версия игры:

source: This Game Version:
ru_ru: Установленная версия игры:

source: Online Game Version:
ru_ru: Версия игры в Стиме:

# NewIRVersion
source: There is a new version of Interstellar Rift! Update your IR Installation!
ru_ru: Обнаружено обновление Interstellar Rift! Требуется обновление сервера!

# IRNewer
source: Interstellar Rifts Version is newer than what this version of IRSE Supports, Check for IRSE updates!
ru_ru: Установленная версия сервера Interstellar Rifts новее, чем так которую поддерживает IRSE! Обновите IRSE!

source: Loading GUI...
ru_ru: Загружаю Графический Интерфейс...

# HelpCommand
source: help - this page ;)
ru_ru: Доступные сервисные команды:

# OpenGUICommand
source: opengui - If closed, will open and/or focus the GUI to the front.
ru_ru: opengui - Открыть графический интерфейс

# StartCommand
source: start - Starts the server if its not running!
ru_ru: start - Запустить сервер

# StopCommand
source: stop - stops the server if it's running!
ru_ru: stop - Остановить сервер

# RestartCommand
source: restart - Restarts IRSE, if autostart is set the server will start automatically.
ru_ru: restart - Перезапустить IRSE, если в настройках установлен автозапуск, то сервер игры так же будет запущен автоматически.

# CheckUpdateCommand
source: checkupdate - Checks for IRSE updates. Prompts user with new update details.
ru_ru: checkupdate - Проверить наличие обновлений IRSE.

# ForceUpdateCommand
source: forceupdate - Forces an Update of IRSE with no prompts.
ru_ru: forceupdate - Обновить IRSE принудительно

# FailedInitPlugin
source: Failed initialization of Plugin {0}. Exception: {1}
ru_ru: Ошибка инициализации плагина {0}. Exception: {1}

# FailedLoadPlugin
source: Failed load of Plugin {0}. Exception: {1}
ru_ru: Ошибка загрузки плагина {0}. Exception: {1}

# FailedLoadAssembly
source: Failed to load assembly : {0} : {1}
ru_ru: Ошибка загрузки сборки : {0} : {1}

# FailedShutdownPlugin
source: Uncaught Exception in Plugin {0}. Exception: {1}
ru_ru: Ошибка остановки плагина: {0}. Exception: {1}

# InitializationPlugin
source: Initialization of Plugin {0} failed. Could not find a public, parameterless constructor for {0}
ru_ru: Ошибка загрузки плагина {0}. Не найден класс public: parameterless constructor for {0}

# InitializingPlugin
source: Initializing Plugin : {0}
ru_ru: Инициализация плагина : {0}

# LoadingPlugin
source: Loading Plugin : {0}
ru_ru: Загрузка плагина : {0}

# ShutdownPlugin
source: Shutting down Plugin {0}
ru_ru: Остановка плагина {0}

# LaunchingServer
source: IRSE: Launching Server...
ru_ru: IRSE: Запускаю сервер...

# NoInitWrapper
source: IRSE: Could not initialize the wrapper. This is a fatal error, please report the exception to the github issues. Shutting Down...
ru_ru: Фатальная ошибка IRSE: Не могу инициализировать обработчик. Сообщите пожалуйста на github в раздел ошибки... Отключение программы...

# WaitingForServer
source: IRSE: Waiting for server
ru_ru: IRSE: Ожидание запуска сервера...

# GameBaseCode
source: IR.exe base game code was probably changed, this is a fatal error, please report the error below to the github issues.
ru_ru: Фатальная ошибка IR.exe: возможно серверные файлы были изменены, сообщите об ощибке на github.

# SteamCMDNoExist
source: SteamCMD does not exist, downloading!
ru_ru: SteamCMD отсутствует, загружаю!

# Unpacking
source: Done! Unpacking and starting SteamCMD to install Interstellar Rift Dedicated Server
ru_ru: Выполнено! Производится запуск SteamCMD для установки серверных файлов игры Interstellar Rift

# ManualModeUnpack
source: Could not download or unpack SteamCMD. Going into manual mode. Please install Interstellar Rift and copy IRSE there!
ru_ru: Невозможно загрузить или распаковать SteamCMD. Переключаюсь в ручной режим. Установите сервер игры самостоятельно и скопируйте туда IRSE.

# CheckingIR
source: Checking/Updating IR
ru_ru: Проверяю/Обновляю серверные файлы...

# ManualModeStart
source: Could not start SteamCMD. Going into manual mode. Please run SteamCMD manually to install or update the dedicated server!
ru_ru: Неудалось запустить SteamCMD. Переключаюсь в ручной режим. Установите сервер игры самостоятельно и скопируйте туда IRSE.

# NotInstalled
source: Interstellar Rift has NOT been installed!
ru_ru: Сервер Interstellar Rift не установлен!

# Success
source: Interstellar Rift has been successfully installed or updated!
ru_ru: Сервер Interstellar Rift успешно установлен или обновлен!

# NoGameVersion
source: Could not get game version from {0}
ru_ru: Не удалось получить версии игры из {0}

source: Are you sure?
ru_ru: Вы уверены?

# ServerOnlineChat
source: Server Online, Ready For Chat.
ru_ru: Сервер онлайн, Чат активирован.

source: Server Config Saved.
ru_ru: Конфигурация сервера сохранена.

source: IRSE Config Saved.
ru_ru: Конфигурация IRSE сохранена.

# LooseServerChanges
source: You want to loose the Server Config changes?
ru_ru: Вы уверены что хотите выйти? Конфигурация еще не сохранена.

# ReloadedServerConfig
source: Reloaded the config from appdata server.json
ru_ru: Загрузка параметров сервера из файла server.json успешно выполнена.

# LooseExtenderConfig
source: You want to loose all changes to the Extender Config?
ru_ru: Вы уверены, что хотите отменить все изменений в конфигурации IRSE?

# ReloadExtenderConfig
source: You wish to reload the Extender Config?
ru_ru: Вы уверены что хотите перезагрузить конфигурацию IRSE?

source: Reloaded extender config.
ru_ru: Конфигурация IRSE перезагружена.

# ReloadServerConfig
source: Are you sure you want to reload the settings from the server.json?
ru_ru: Вы уверены что хотите перезагрузить параметры из файла конфигурации сервера jserver.json?

source: Server Settings
ru_ru: Настройки сервера

# ServerStopped
source: The Server Is Already Stopped
ru_ru: Сервер уже остановлен.

# KickPlayers
source: You wish to Kick the selected Player(s)?
ru_ru: Вы уверены, что хотите выгнать текущего игрока(ов)?

# BanPlayers
source: You wish to Ban the selected Player(s)?
ru_ru: Вы уверены, что хотите забаннить текущего игрока(ов)?

# ForgetPlayers
source: You wish to Forget the selected Player(s)? This will kick the selected players, then force them to pick a faction the next time they login.
ru_ru: Вы уверены, что хотите "обнулить" текущего игрока(ов)? Данное действие выгонит игроков в сервера и полностью обнулит их игрового персонажа - нужно будет начинать с выбора фракции...

# KillPlayers
source: You wish to Kill the selected Player(s)?
ru_ru: Вы уверены, что хотите убить текущего игрока(ов)?

# ToggleAdmin
source: You wish to Toggle Admin on the selected Player(s)?
ru_ru: Вы уверены, что хотите сделать админом выбранного игрока(ов)?

# GuiCheckingUpdates
source: Checking for updates...
ru_ru: Проверяю обновления...

# GuiRunningLatest
source: You are running the latest version!
ru_ru: Поздравляем, у Вас самая последняя версия!

# GuiNewVersion
source: A new version has been detected: {0} Release Information: Release Name: {1} Download Count: {2} Release Published {3} Release Description: {4} Would you like to update now?
ru_ru: Обнаружена новая версия: {0} Информация о релизе: Название: {1} Количество загрузок: {2} Дата выпуска: {3} Описание: {4} Хотите обновиться сейчас??

# GuiIRSEUpdater
source: IRSE Updater
ru_ru: Обновление IRSE

# GuiCanceledUpdate
source: The Update has been canceled.
ru_ru: Обновление отменено.

# GuiUpdateApply
source: The Update is being applied..
ru_ru: Обновление выполняется...

# GuiDialogMustRestart
source: You must restart before the update can be completed! Would you like to restart now? Note: The server was saved after downloading this release.
ru_ru: Вам необходимо перезапустить сервер перед тем, как обновление будет завершено! Хотите перезапуститься сейчас? прим: Состояние сервера будет сохранено

# GuiExtenderUpdater
source: Extender Updater
ru_ru: Обновление IRSE

# GuiNeedsRestart
source: IRSE needs to be restarted before you can use the new features!
ru_ru: IRSE должен быть перегазружен для применения обновления!

source: Restart IRSE?
ru_ru: Перезапустить IRSE?

source: Close IRSE?
ru_ru: Закрыть IRSE?
